<div class="task">
    <p>
        PHP файл должен начинаться с открывающего тега "&lt;?php" после которого следует код.
        В нашем курсе мы будем пропускать написание этого тега каждый раз. Условно он у нас будет написан.
        Курс устроен просто - нужно в точности писать требуемый кодю Пробелы значения не имеют, но желательны для соблюдения.
        Регистр имеет значение: $var и $Var не одно и тоже. Внимательно нужно следить за всеми запятыми,точками ,точками с запятыми и так далее.
        Ну что ж, в путь! Итак традиционно напишем наш первый скрипт - вывести строчку 'Hello World!' на экран.
    </p>
</div>
<div class="separator"></div>
<pre>
<code class="php">
echo "Hello World!";
</code>
</pre>