<?php

return [
    1492559445 => [
        'id' => 1492559445,
        'url' => 'trim',
        'title' => 'Функция trim',
        'description' => 'как удалить пробелы в начале и конце строки в PHP, удаление пробелов в строке PHP',
        'prev' => 1492555795,
        'next' => 1494269323
    ],
    1494269323 => [
        'id' => 1494269323,
        'url' => 'str_replace',
        'title' => 'Функция str_replace',
        'description' => 'как заменить символы в строке PHP',
        'prev' => 1492559445,
        'next' => 1494271380
    ],
    1494271380 => [
        'id' => 1494271380,
        'url' => 'str_replace_2',
        'title' => 'Функция str_replace - 2',
        'description' => 'как заменить символы в строке PHP',
        'prev' => 1494269323,
        'next' => 1494278484
    ],
    1494278484 => [
        'id' => 1494278484,
        'url' => 'strlen',
        'title' => 'Функция strlen',
        'description' => 'узнать длинну строки в PHP',
        'prev' => 1494271380,
        'next' => 1494279078
    ],
    1494279078 => [
        'id' => 1494279078,
        'url' => 'strpos',
        'title' => 'Функция strpos',
        'description' => 'узнать позицию вхождения подстроки строки в PHP, обрезать строку в PHP',
        'prev' => 1494278484,
        'next' => 1494797102
    ],
    1494797102 => [
        'id' => 1494797102,
        'url' => 'strtolower',
        'title' => 'Функция strtolower',
        'description' => 'сделать все буквы маленькими в PHP',
        'prev' => 1494279078,
        'next' => 1494797388
    ],
    1494797388 => [
        'id' => 1494797388,
        'url' => 'strtoupper',
        'title' => 'Функция strtoupper',
        'description' => 'сделать все буквы большими в PHP',
        'prev' => 1494797102,
        'next' => 1494798201
    ],
    1494798201 => [
        'id' => 1494798201,
        'url' => 'ucfirst',
        'title' => 'Функция ucfirst',
        'description' => 'сделать первую букву в строке большой в PHP',
        'prev' => 1494797388,
        'next' => 1494798520
    ],
    1494798520 => [
        'id' => 1494798520,
        'url' => 'ucwords',
        'title' => 'Функция ucwords',
        'description' => 'сделать заглавными буквы в PHP',
        'prev' => 1494798201,
        'next' => 1494801105
    ],
    1494801105 => [
        'id' => 1494801105,
        'url' => 'substr',
        'title' => 'Функция substr',
        'description' => 'вырезать часть строки в PHP',
        'prev' => 1494798520,
        'next' => 1494801524
    ],
];