<?php

return [
    1494801524 => [
        'id' => 1494801524,
        'url' => 'array',
        'title' => 'Тип данных массив',
        'description' => 'массивы в PHP',
        'prev' => 1494801105,
        'next' => 1494883400
    ],
    1494883400 => [
        'id' => 1494883400,
        'url' => 'array_index',
        'title' => 'Ключи массива',
        'description' => 'массивы в PHP, ключи массива, как обратиться к значению массива по его ключу',
        'prev' => 1494801524,
        'next' => 1494886140
    ],
    1494886140 => [
        'id' => 1494886140,
        'url' => 'empty',
        'title' => 'Функция empty',
        'description' => 'если ключа нет в массиве PHP, несуществующий ключ в массиве PHP, несуществующая переменная в PHP',
        'prev' => 1494883400,
        'next' => 1494971118
    ],
    1494971118 => [
        'id' => 1494971118,
        'url' => 'nested_array',
        'title' => 'Вложенные массивы',
        'description' => 'Вложенные массивы в PHP, многомерные массивы в PHP',
        'prev' => 1494886140,
        'next' => 1495317668
    ],
    1495317668 => [
        'id' => 1495317668,
        'url' => 'array_chunk',
        'title' => 'Функция array_chunk',
        'description' => 'разбить массив на части в PHP',
        'prev' => 1494971118,
        'next' => 1495321200
    ],
    1495321200 => [
        'id' => 1495321200,
        'url' => 'count',
        'title' => 'Функция count',
        'description' => 'посчитать элементы массива в PHP, посчитать количество символов в строке в PHP',
        'prev' => 1495317668,
        'next' => 1495399175
    ],
    1495399175 => [
        'id' => 1495399175,
        'url' => 'array_key_exists',
        'title' => 'Функция array_key_exists',
        'description' => 'проверить есть ли ключ в массиве PHP',
        'prev' => 1495321200,
        'next' => 1495400445
    ],
    1495400445 => [
        'id' => 1495400445,
        'url' => 'array_keys',
        'title' => 'Функция array_keys',
        'description' => 'выбрать все ключи в массиве PHP',
        'prev' => 1495399175,
        'next' => 1495572643
    ],
    1495572643 => [
        'id' => 1495572643,
        'url' => 'array_merge',
        'title' => 'Функция array_merge',
        'description' => 'слияние массивов в PHP, объединить два массива в PHP, слить два массива в PHP',
        'prev' => 1495400445,
        'next' => 1495573561
    ],
    1495573561 => [
        'id' => 1495573561,
        'url' => 'array_reverse',
        'title' => 'Функция array_reverse',
        'description' => 'перевернуть массив в PHP',
        'prev' => 1495572643,
        'next' => 1495662217
    ],
    1495662217 => [
        'id' => 1495662217,
        'url' => 'array_slice',
        'title' => 'Функция array_slice',
        'description' => 'срез массива в PHP, обрезать массив в PHP',
        'prev' => 1495573561,
        'next' => 1495738683
    ],
    1495738683 => [
        'id' => 1495738683,
        'url' => 'array_unique',
        'title' => 'Функция array_unique',
        'description' => 'уникальные значения в массиве PHP, убрать повторяющиеся значения в массиве PHP',
        'prev' => 1495662217,
        'next' => 1495740061
    ],
    1495740061 => [
        'id' => 1495740061,
        'url' => 'array_values',
        'title' => 'Функция array_values',
        'description' => 'выбрать только значения из массива PHP',
        'prev' => 1495738683,
        'next' => 1496179970
    ],
    1496179970 => [
        'id' => 1496179970,
        'url' => 'asort',
        'title' => 'Функция asort',
        'description' => 'сортировка массива по значению PHP c сохранением ключей, отсортировать массив по значению PHP с сохранением ключей',
        'prev' => 1495740061,
        'next' => 1496353282
    ],
    1496353282 => [
        'id' => 1496353282,
        'url' => 'ksort',
        'title' => 'Функция ksort',
        'description' => 'сортировка массива по ключу PHP, отсортировать массив по ключу PHP, сортировка массива по индексу PHP',
        'prev' => 1496179970,
        'next' => null
    ],
];