<?php

return [
    1490999697 => [
        'id' => 1490999697,
        'url' => 'hello_world',
        'title' => 'Вывод "Hello World!" на экран',
        'description' => 'открывающий и закрывающий теги в PHP. вывод Hello World PHP',
        'prev' => null,
        'next' => 1490999768
    ],
    1490999768 => [
        'id' => 1490999768,
        'url' => 'echo',
        'title' => 'Функция "echo"',
        'description' => 'функция echo в PHP. PHP вывести строку на экран',
        'prev' => 1490999697,
        'next' => 1492029870
    ],
    1492029870 => [
        'id' => 1492029870,
        'url' => 'variable',
        'title' => 'Именование переменной',
        'description' => 'Переменные в PHP. Как назвать переменную в PHP',
        'prev' => 1490999768,
        'next' => 1492030396
    ],
    1492030396 => [
        'id' => 1492030396,
        'url' => 'variable_1',
        'title' => 'Смена значения переменной',
        'description' => 'как присвоить значение переменой в PHP',
        'prev' => 1492029870,
        'next' => 1492031602
    ],
    1492031602 => [
        'id' => 1492031602,
        'url' => 'variable_2',
        'title' => 'Смена значения переменной - 2',
        'description' => 'Присваиваем значение одной переменной другой переменной',
        'prev' => 1492030396,
        'next' => 1492031812
    ],
    1492031812 => [
        'id' => 1492031812,
        'url' => 'var_dump',
        'title' => 'Функция "var_dump"',
        'description' => 'функция var_dump в PHP. вывод информации о переменной в PHP',
        'prev' => 1492031602,
        'next' => 1492296507
    ],
    1492296507 => [
        'id' => 1492296507,
        'url' => 'data_types',
        'title' => 'Тип данных integer - число',
        'description' => 'Типы данных в PHP. Тип данных integer - число',
        'prev' => 1492031812,
        'next' => 1492304516
    ],
    1492304516 => [
        'id' => 1492304516,
        'url' => 'integer_data_type_1',
        'title' => 'Тип данных integer - 1',
        'description' => 'Типы данных в PHP. Тип данных integer - число',
        'prev' => 1492296507,
        'next' => 1492304767
    ],
    1492304767 => [
        'id' => 1492304767,
        'url' => 'integer_data_type_2',
        'title' => 'Тип данных integer - 2',
        'description' => 'Типы данных в PHP. Тип данных integer - число',
        'prev' => 1492304516,
        'next' => 1492307430
    ],
    1492307430 => [
        'id' => 1492307430,
        'url' => 'float_data_type_1',
        'title' => 'Тип данных float - 1',
        'description' => 'Типы данных в PHP. Тип данных float - число с плавающей',
        'prev' => 1492304767,
        'next' => 1492308165
    ],
    1492308165 => [
        'id' => 1492308165,
        'url' => 'float_data_type_2',
        'title' => 'Тип данных float - 2',
        'description' => 'Типы данных в PHP. Тип данных float - число с плавающей',
        'prev' => 1492307430,
        'next' => 1494969094
    ],
    1494969094 => [
        'id' => 1494969094,
        'url' => 'boolean_data_type',
        'title' => 'Двоичный тип данных',
        'description' => 'Двоичный тип данных в PHP. Тип данных boolean в PHP',
        'prev' => 1492308165,
        'next' => 1494969584
    ],
    1494969584 => [
        'id' => 1494969584,
        'url' => 'null_data_type',
        'title' => 'Тип данных null',
        'description' => 'null в PHP. Тип данных null в PHP',
        'prev' => 1494969094,
        'next' => 1492459846
    ],

    1492459846 => [
        'id' => 1492459846,
        'url' => 'string_data_type',
        'title' => 'Тип данных string',
        'description' => 'Типы данных в PHP. Тип данных string - строка',
        'prev' => 1494969584,
        'next' => 1492467724
    ],
    1492467724 => [
        'id' => 1492467724,
        'url' => 'concat',
        'title' => 'Конкатенация строк',
        'description' => 'Тип данных string в PHP. Конкатенация строк',
        'prev' => 1492459846,
        'next' => 1492468812
    ],
    1492468812 => [
        'id' => 1492468812,
        'url' => 'quotes',
        'title' => 'Двойные и одинарные кавычки',
        'description' => 'Чем отличаются двойные и одинарные кавычки в PHP',
        'prev' => 1492467724,
        'next' => 1492471100
    ],
    1492471100 => [
        'id' => 1492471100,
        'url' => 'function',
        'title' => 'Функции',
        'description' => 'Функции в PHP',
        'prev' => 1492468812,
        'next' => 1492474307
    ],
    1492474307 => [
        'id' => 1492474307,
        'url' => 'function_1',
        'title' => 'Аргументы функции',
        'description' => 'Аргументы функции в PHP',
        'prev' => 1492471100,
        'next' => 1492553485
    ],
    1492553485 => [
        'id' => 1492553485,
        'url' => 'function_2',
        'title' => 'Аргументы функции - 2',
        'description' => 'Несколько аргументов PHP функции, повторное использование функций',
        'prev' => 1492474307,
        'next' => 1492555795
    ],
    1492555795 => [
        'id' => 1492555795,
        'url' => 'function_3',
        'title' => 'Аргументы функции - 3',
        'description' => 'Аргументы функции в PHP. Значение фргумента по умолчанию',
        'prev' => 1492553485,
        'next' => 1492559445
    ]
];