Разберем вывод<br>
array(3) { //массив из 3х элементов<br>
[0] => array(2)//первый элемент с ключом 0 и массивом из 2х элементов в качестве значения<br>
["zaz"] => int(100) //первый элемент с ключом 'zaz'(строка) и значением 100(число)<br>
["vaz"] => int(200) //второй элемент с ключом 'vaz' и значением 200<br>
[1] => array(2) //второй элемент с ключом 1 и массивом из 2х элементов в качестве значения<br>
["maz"] => int(300) //первый элемент с ключом 'maz' и значением 300<br>
["kraz"] => int(400) //второй элемент с ключом 'kraz' и значением 400<<br>
[2] => array(1) //третий элемент с ключом 2 и массивом из одного элемента в качестве значения<br>
["belaz"] => int(500) //первый элемент с ключом 'belaz' и значением 500<br>